app/controllers/users_controller.rb

SELECT COUNT(*) FROM "users"
---
    def index
      @users = User.paginate(page: params[:page], per_page: 2)

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "remember_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
  	@user = User.new(user_params)
  	if @user.save